---
kind: type
id: T:Autodesk.Revit.DB.StructDeckEmbeddingType
source: html/2cc96ee3-bb7b-26e8-271c-25975dbc9fc4.htm
---
# Autodesk.Revit.DB.StructDeckEmbeddingType

Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.

## Syntax (C#)
```csharp
public enum StructDeckEmbeddingType
```